app/Controllers/Home.php

SELECT *
FROM `about_profile`
 LIMIT 1
SELECT *
FROM `products`
ORDER BY `created_at` DESC
 LIMIT 4
SELECT *
FROM `news`
ORDER BY `tanggal` DESC
 LIMIT 1
---
    public function index()
    {
        $aboutModel   = new AboutProfileModel();
        $serviceModel = new ServiceListModel();
        $productModel = new ProductModel();
        $newsModel    = new NewsModel();

        $data = [
            'title'       => 'Beranda | PT. Arif Agro Farm',
            'active'      => 'beranda',
            'profile'     => $aboutModel->first(),
            'services'    => $serviceModel->findAll(3),
            'products'    => $productModel->orderBy('created_at', 'DESC')->findAll(4),
            'latest_news' => $newsModel->orderBy('tanggal', 'DESC')->first()

SELECT *
FROM `about_profile`
 LIMIT 1
SELECT *
FROM `about_teams`
 LIMIT 4
SELECT *
FROM `about_mitra`
---
    public function tentang()
    {
        $profileModel = new AboutProfileModel();
        $teamModel    = new AboutTeamModel();
        $mitraModel   = new AboutMitraModel();

        $profil    = $profileModel->first();
        // Memecah string misi menjadi array jika ada datanya
        $arrayMisi = $profil ? explode('|', $profil['misi']) : [];

        $data = [
            'title'   => 'Tentang Kami | PT. Arif Agro Farm',
            'active'  => 'tentang',
            'profile' => $profil,
            'misi'    => $arrayMisi,
            'teams'   => $teamModel->findAll(4),
            'mitra'   => $mitraModel->findAll()

SELECT *
FROM `news`
ORDER BY `tanggal` DESC
SELECT *
FROM `announcements`
WHERE `expired_at` >= '2026-02-10'
ORDER BY `tanggal` DESC
---
    public function berita()
    {
        $newsModel = new NewsModel();
        $annModel  = new AnnouncementModel();

        $today = date('Y-m-d');

        $data = [
            'title'  => 'Berita & Artikel | Arif Agro Farm',
            'active' => 'berita',
            'news'   => $newsModel->orderBy('tanggal', 'DESC')->findAll(),
            // Filter: Hanya tampilkan pengumuman yang belum kadaluarsa
            'announcements' => $annModel->where('expired_at >=', $today)
                                        ->orderBy('tanggal', 'DESC')
                                        ->findAll()